---
kind: method
id: M:Autodesk.Revit.DB.Structure.EndTreatmentType.Create(Autodesk.Revit.DB.Document)
zh: 创建、新建、生成、建立、新增
source: html/1aa3160e-1ef5-273b-f480-f171f15fa555.htm
---
# Autodesk.Revit.DB.Structure.EndTreatmentType.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new EndTreatmentType in a document.

## Syntax (C#)
```csharp
public static EndTreatmentType Create(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null